KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.h
	//! Structure Variable : Packet length
	/*!
 	*/
	uint8_t length;

	//! Structure Variable : Packet payload
	/*!
 	*/
	uint8_t data[251];

	//! Structure Variable : Retry number
	/*!
 	*/
	uint8_t retry;
}pack;

typedef enum
{
    true=1, false=0
}bool;

/******************************************************************************
 * SX1278 FUNCTION*************************************************************
 ******************************************************************************/
		void SX1278(void);
		//REG CONTROLLING FUNCTION
		uint16_t HW_SPI_InOut(SPI_HandleTypeDef *hspi, uint16_t txData );
		void SX1272ReadBuffer(SPI_HandleTypeDef *hspi, uint8_t addr, uint8_t *buffer, uint8_t size );
		void SX1272WriteBuffer(SPI_HandleTypeDef *hspi, uint8_t addr, uint8_t *buffer, uint8_t size );
  	//! It reads an internal module register.
  	/*!
  	\param uint8_t address : address register to read from.
		\return the content of the register.
		*/
		uint8_t readRegister(SPI_HandleTypeDef *hspi, uint8_t address);

		//! It writes in an internal module register.
  	/*!
  	\param uint8_t address : address register to write in.
  	\param uint8_t data : value to write in the register.
		*/
		void writeRegister(SPI_HandleTypeDef *hspi, uint8_t address, uint8_t data);
		//! It puts the module ON
  	/*!
		\param void
		\return void
		*/
		//END REG CONTROLLING FUNCTION
		float timeOnAir( uint16_t payloadlength );

		//! It sets the payload of the packet that is going to be sent.
  	/*!
  	\param char *payload : packet payload.
		\return '0' on success, '1' otherwise
		*/
		uint8_t setPayload(SPI_HandleTypeDef *hspi, char *payload);

		//! It checks if there is an available packet and its destination before a
		//! timeout.
  	/*!
  	\param uint32_t wait : time to wait while there is no a valid header received.
		\return 'true' on success, 'false' otherwise
		*/
		_Bool	availableData(SPI_HandleTypeDef *hspi, uint32_t wait);

		//! It checks if there is an available packet and its destination.
		/*!
		\return 'true' on success, 'false' otherwise
		*/
		_Bool	availableData_MAX_TIMEOUT(SPI_HandleTypeDef *hspi);

		//! It clears the interruption flags.
  	/*!
		\param void
		\return void
		*/
		void clearFlags(SPI_HandleTypeDef *hspi);

		//! It receives and gets an ACK from FIFO, if it arrives before ending
		//! 'wait' time.
		/*!
		 *
		\param uint32_t wait : time to wait while there is no an ACK received.
		\return '8'  --> The ACK lost
				'7'  --> The ACK destination incorrectly received
				'6'  --> The ACK source incorrectly received
				'5'  --> The ACK number incorrectly received
				'4'  --> The ACK length incorrectly received
				'3'  --> N-ACK received
				'2'  --> The ACK has not been received
				'1'  --> not used (reserved)
				'0'  --> The ACK has been received with no errors
		*/
		uint8_t getACK(SPI_HandleTypeDef *hspi, uint32_t wait);
		//! If an ACK is received, it gets it and checks its content.
		/*!
		 *
		\return '8'  --> The ACK lost
				'7'  --> The ACK destination incorrectly received
				'6'  --> The ACK source incorrectly received
				'5'  --> The ACK number incorrectly received
				'4'  --> The ACK length incorrectly received
				'3'  --> N-ACK received
				'2'  --> The ACK has not been received
				'1'  --> not used (reserved)
				'0'  --> The ACK has been received with no errors
		*/
		uint8_t getACK_MAX_TIMEOUT(SPI_HandleTypeDef *hspi);

		//! It is true if the BW selected exists.
  	/*!
		\param uint16_t band : bandwidth value to check.
		\return 'true' on success, 'false' otherwise
		*/
		_Bool	isBW(uint16_t band);

		//! It gets the BW configured.
  	/*!
		It stores in global '_bandwidth' variable the BW selected in the configuration
		\return '0' on success, '1' otherwise
		*/
		int8_t	getBW(SPI_HandleTypeDef *hspi);

		//! It is true if the CR selected exists.
  	/*!
		\param uint8_t cod : the coding rate value to check.
		\return 'true' on success, 'false' otherwise
		*/
		_Bool	isCR(uint8_t cod);

		//! It gets the CR configured.
  	/*!
		It stores in global '_codingRate' variable the CR selected
		in the configuration
		\return '0' on success, '1' otherwise
		*/
		int8_t	getCR(SPI_HandleTypeDef *hspi);

		//! It gets the CRC configured.
  	/*!
  	It stores in global '_CRC' variable '1' enabling CRC generation on
  	payload, or '0' disabling the CRC.
		\return '0' on success, '1' otherwise
		*/
		uint8_t	getCRC(SPI_HandleTypeDef *hspi);

		//! It is true if the channel selected exists.
  	/*!
		\param uint32_t ch : frequency channel value to check.
		\return 'true' on success, 'false' otherwise
		*/
		_Bool isChannel(uint32_t ch);

		//! It gets frequency channel the module is using.
  	/*!
		It stores in global '_channel' variable the frequency channel
		\return '0' on success, '1' otherwise
		*/
		uint8_t getChannel(SPI_HandleTypeDef *hspi);

		//! It gets the header mode configured.
  	/*!
  	It stores in global '_header' variable '0' when header is sent
  	(explicit header mode) or '1' when is not sent (implicit header
  	mode).
		\return '0' on success, '1' otherwise
		*/
		uint8_t	getHeader(void);

		//! It gets the maximum current supply by the module.
		/*!
  	\return '0' on success, '1' otherwise
		*/
		uint8_t getMaxCurrent(SPI_HandleTypeDef *hspi);

		//! It sets the LoRa mode on.
  	/*!
  	It stores in global '_LORA' variable '1' when success
    \return '0' on success, '1' otherwise
		*/
		uint8_t setLORA(SPI_HandleTypeDef *hspi);


		//! It sets the maximum current supply by the module.
		/*!
		It stores in global '_maxCurrent' variable the maximum current supply.
  	\param uint8_t rate : maximum current supply.
		\return '0' on success, '1' otherwise
		*/
		int8_t setMaxCurrent(SPI_HandleTypeDef *hspi, uint8_t rate);

		//! It sets the node address of the mote.
  	/*!
  	It stores in global '_nodeAddress' variable the node address
  	\param uint8_t addr : address value to set as node address.
		\return '0' on success, '1' otherwise
		*/
		int8_t setNodeAddress(SPI_HandleTypeDef *hspi, uint8_t addr);

		//! It sets the destination of a packet.
  	/*!
  	\param uint8_t dest : value to set as destination address.
		\return '0' on success, '1' otherwise
		*/
		int8_t setDestination(uint8_t dest);

		//! It sets the maximum number of bytes from a frame that fit in a packet
		//! structure.
		/*!
		It stores in global '_payloadlength' variable the maximum number of bytes.
  	\param uint16_t length16 : total frame length.
		\return '0' on success, '1' otherwise
		*/
		uint8_t truncPayload(uint16_t length16);

		//! It sets the packet length to send/receive.
  	/*!
  	It stores in global '_payloadlength' variable the payload length of
    the last packet to send/receive.
  	\param uint8_t l : payload length to set in the configuration.
		\return '0' on success, '1' otherwise
		*/
		int8_t setPacketLength(SPI_HandleTypeDef *hspi, uint8_t l);

		//! It sets the packet length to send/receive.
  	/*!
  	It stores in global '_payloadlength' variable the payload length of
    the last packet to send/receive.
		\return '0' on success, '1' otherwise
		*/
		int8_t setPacketLength_payloadlength(SPI_HandleTypeDef *hspi);

		//! It writes a packet in FIFO in order to send it.
		/*!
		\param uint8_t dest : packet destination.
		\param char *payload : packet payload.
		\return '0' on success, '1' otherwise
		*/
		uint8_t setPacket(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload);

