KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.h
		//! It is true if the SF selected exists.
  	/*!
		\param uint8_t spr : spreading factor value to check.
		\return 'true' on success, 'false' otherwise
		*/
		_Bool	isSF(uint8_t spr);

		//! It sets implicit header mode.
  	/*!
  	It stores in global '_header' variable '0' when success
		\return '0' on success, '1' otherwise
		*/
		int8_t	setHeaderOFF(SPI_HandleTypeDef *hspi);

		//! It sets the SF.
  	/*!
		It stores in global '_spreadingFactor' variable the current value of SF
		\param uint8_t spr : spreading factor value to set in the configuration.
		\return '0' on success, '1' otherwise
		*/
		uint8_t	setSF(SPI_HandleTypeDef *hspi, uint8_t spr);

		//! It writes an ACK in FIFO to send it.
		/*!
		*
		\return '0' on success, '1' otherwise
		*/
		uint8_t setACK(SPI_HandleTypeDef *hspi);

		//! It gets the SF configured.
  	/*!
		It stores in global '_spreadingFactor' variable the current value of SF
		\return '0' on success, '1' otherwise
		*/
		int8_t	getSF(SPI_HandleTypeDef *hspi);

		//! It sets the BW.
  	/*!
		It stores in global '_bandwidth' variable the BW selected
		in the configuration
		\param uint16_t band : bandwidth value to set in the configuration.
		\return '0' on success, '1' otherwise
		*/
		int8_t setBW(SPI_HandleTypeDef *hspi, uint16_t band);

		//! It sets the CR.
  	/*!
		It stores in global '_codingRate' variable the CR selected
		in the configuration
		\param uint8_t cod : coding rate value to set in the configuration.
		\return '0' on success, '1' otherwise
		*/
		int8_t	setCR(SPI_HandleTypeDef *hspi, uint8_t cod);

		//! It sets CRC on.
  	/*!
  	It stores in global '_CRC' variable '1' when success
		\return '0' on success, '1' otherwise
		*/
		uint8_t	setCRC_ON(SPI_HandleTypeDef *hspi);

		//! It sets CRC off.
  	/*!
  	It stores in global '_CRC' variable '0' when success
		\return '0' on success, '1' otherwise
		*/
		uint8_t	setCRC_OFF(SPI_HandleTypeDef *hspi);


		//! It sets frequency channel the module is using.
  	/*!
		It stores in global '_channel' variable the frequency channel
		\param uint32_t ch : frequency channel value to set in the configuration.
		\return '0' on success, '1' otherwise
		*/
		int8_t setChannel(SPI_HandleTypeDef *hspi, uint32_t ch);

		//! It sets the FSK mode on.
  	/*!
  	It stores in global '_FSK' variable '1' when success
		\return '0' on success, '1' otherwise
		*/
		uint8_t setFSK(SPI_HandleTypeDef *hspi);

		//! It sets explicit header mode.
  	/*!
  	It stores in global '_header' variable '1' when success
		\return '0' on success, '1' otherwise
		*/
		int8_t	setHeaderON(SPI_HandleTypeDef *hspi);

		//! It sets the BW, SF and CR of the module.
  	/*!
		It stores in global '_bandwidth' variable the BW
		It stores in global '_codingRate' variable the CR
		It stores in global '_spreadingFactor' variable the SF
		\param uint8_t mode : there is a mode number to different values of
		the	configured parameters with this function.
		\return '0' on success, '1' otherwise
		*/
		int8_t setMode(SPI_HandleTypeDef *hspi, uint8_t mode);

		//! It sets the output power of the signal.
  	/*!
		It stores in global '_power' variable the output power of the signal
		\param char p : 'M', 'H' or 'L' if you want Maximum, High or Low
		output power signal.
		\return '0' on success, '1' otherwise
		*/
		int8_t setPower(SPI_HandleTypeDef *hspi, char p);

		//! It sets the output power of the signal.
		/*!
		It stores in global '_power' variable the output power of the signal
		\param uint8_t pow : value to set as output power.
		\return '0' on success, '1' otherwise
		*/
		int8_t setPowerNum(SPI_HandleTypeDef *hspi, uint8_t pow);

		//! It gets the preamble length configured.
  	/*!
		It stores in global '_preamblelength' variable the preamble length
		\return '0' on success, '1' otherwise
		*/
		uint8_t getPreambleLength(SPI_HandleTypeDef *hspi);

		//! It sets the preamble length.
  	/*!
    It stores in global '_preamblelength' variable the preamble length
  	\param uint16_t l : preamble length to set in the configuration.
		\return '0' on success, '1' otherwise
		*/
		uint8_t setPreambleLength(SPI_HandleTypeDef *hspi, uint16_t l);

		//! It sets the total of retries when a packet is not correctly received.
		/*!
		It stores in global '_maxRetries' variable the number of retries.
  	\param uint8_t ret : number of retries.
		\return '0' on success, '1' otherwise
		*/
		uint8_t setRetries(SPI_HandleTypeDef *hspi, uint8_t ret);

		//! It sets the waiting time to send a packet.
  	/*!
   	It stores in global '_sendTime' variable the time for each mode.
		\return '0' on success, '1' otherwise
		*/
		uint8_t setTimeout(void);

		//! It puts the module ON
		uint8_t ON(SPI_HandleTypeDef *hspi);

		//! It puts the module OFF
  	/*!
		\param void
		\return void
		*/
		void OFF(void);

		//! It gets the BW, SF and CR of the module.
  	/*!
		It stores in global '_bandwidth' variable the BW
		It stores in global '_codingRate' variable the CR
		It stores in global '_spreadingFactor' variable the SF
		\return '0' on success, '1' otherwise
		*/
		uint8_t getMode(SPI_HandleTypeDef *hspi);


		//! It gets the node address of the mote.
  	/*!
  	It stores in global '_nodeAddress' variable the node address
		\return '0' on success, '1' otherwise
		*/
		uint8_t getNodeAddress(SPI_HandleTypeDef *hspi);

		//! It receives and gets a packet from FIFO, if it arrives before ending
		//! 'wait' time.
		/*!
		*
		\param uint32_t wait : time to wait while there is not a complete packet received.
		\return '0' on success, '1' otherwise
		*/
		int8_t getPacket(SPI_HandleTypeDef *hspi, uint32_t wait);

		//! It reads a received packet from the FIFO, if it arrives before ending
		//! MAX_TIMEOUT time.
		/*!
		*
		\return '0' on success, '1' otherwise
		*/
		uint8_t getPacketMAXTimeout(SPI_HandleTypeDef *hspi);

		//! It gets the payload length of the last packet to send/receive.
  	/*!
    It stores in global '_payloadlength' variable the payload length of
    the last packet to send/receive.
		\return '0' on success, '1' otherwise
		*/
		uint8_t getPayloadLength(SPI_HandleTypeDef *hspi);

		//! It gets the output power of the signal.
  	/*!
		It stores in global '_power' variable the output power of the signal
		\return '0' on success, '1' otherwise
		*/
		uint8_t getPower(SPI_HandleTypeDef *hspi);

		//! It gets the internal temperature of the module.
		/*!
		It stores in global '_temp' variable the module temperature.
		\return '0' on success, '1' otherwise
		*/
		uint8_t getTemp(SPI_HandleTypeDef *hspi);

