KienHoangBKHN/RoLa_GW_20172/Src/STM32_SX1278.h
		//! It gets the content of the main configuration registers.
  	/*!
		It stores in global '_bandwidth' variable the BW.
		It stores in global '_codingRate' variable the CR.
		It stores in global '_spreadingFactor' variable the SF.
		It stores in global '_power' variable the output power of the signal.
  	It stores in global '_channel' variable the frequency channel.
  	It stores in global '_CRC' variable '1' enabling CRC generation on
  	payload, or '0' disabling the CRC.
  	It stores in global '_header' variable '0' when header is sent (explicit header mode) or '1' when is not sent (implicit header mode).
		It stores in global '_preamblelength' variable the preamble length.
    It stores in global '_payloadlength' variable the payload length of the last packet to send/receive.
  	It stores in global '_nodeAddress' variable the node address.
		It stores in global '_temp' variable the module temperature.
		\return '0' on success, '1' otherwise
		*/
		uint8_t getRegs(SPI_HandleTypeDef *hspi);

		//! It gets the current value of RSSI.
  	/*!
		It stores in global '_RSSI' variable the current value of RSSI
		\return '0' on success, '1' otherwise
		*/
		uint8_t getRSSI(SPI_HandleTypeDef *hspi);

		//! It gets the SNR of the latest received packet.
  	/*!
		It stores in global '_SNR' variable the SNR
		\return '0' on success, '1' otherwise
		*/
		int8_t getSNR(SPI_HandleTypeDef *hspi);

		//! It gets the RSSI of the latest received packet.
  	/*!
		It stores in global '_RSSIpacket' variable the RSSI of the latest
		packet received.
		\return '0' on success, '1' otherwise
		*/
		int16_t getRSSIpacket(SPI_HandleTypeDef *hspi);

		//! It tries to send the packet stored in FIFO before ending 'wait' time.
		/*!
		\param uint32_t wait : time to wait to send the packet.
		\return '0' on success, '1' otherwise
		*/
		uint8_t sendWithTimeout(SPI_HandleTypeDef *hspi, uint32_t wait);

		//! It sends the packet stored in FIFO before ending _sendTime time.
		/*!
		*
		\return '0' on success, '1' otherwise
		*/
		uint8_t sendWithTimeout_sendtime(SPI_HandleTypeDef *hspi);

		//! It sends the packet which payload is a parameter before ending
		//! MAX_TIMEOUT.
		/*!
		\param uint8_t dest : packet destination.
		\param char *payload : packet payload.
		\return '0' on success, '1' otherwise
		*/

		uint8_t sendPacketTimeout_sendtime(SPI_HandleTypeDef *hspi,	uint8_t dest, char *payload);

		//! It puts the module in reception mode.
  	/*!
  	 *
		\return '0' on success, '1' otherwise
		*/
		uint8_t receive(SPI_HandleTypeDef *hspi);

		//! It puts the module in 'promiscuous' reception mode with a timeout.
  	/*!
  	\param uint32_t wait : time to wait to receive something.
		\return '0' on success, '1' otherwise
		*/
		uint8_t receiveAll(SPI_HandleTypeDef *hspi, uint32_t wait);

		//! It puts the module in 'promiscuous' reception mode with a MAX_timeout.
  	/*!
  	\param uint32_t wait : time to wait to receive something.
		\return '0' on success, '1' otherwise
		*/
		uint8_t	receiveAll_MAX_TIMEOUT(SPI_HandleTypeDef *hspi);

		//! It receives a packet before a timeout.
  	/*!
  	\param uint32_t wait : time to wait to receive something.
		\return '0' on success, '1' otherwise
		*/
		uint8_t receivePacketTimeout(SPI_HandleTypeDef *hspi, uint32_t wait);

		//! It receives a packet before a timeout and reply with an ACK.
  	/*!
  	\param uint32_t wait : time to wait to receive something.
		\return '0' on success, '1' otherwise
		*/
		uint8_t receivePacketTimeoutACK(SPI_HandleTypeDef *hspi, uint32_t wait);
		uint8_t receivePacketTimeout_sendTime(SPI_HandleTypeDef *hspi);
		uint8_t receivePacketMAXTimeout(SPI_HandleTypeDef *hspi);
		uint8_t receivePacketMAXTimeoutACK(SPI_HandleTypeDef *hspi);
		uint8_t receivePacketTimeoutACK_sendTime(SPI_HandleTypeDef *hspi);
		uint8_t sendPacketTimeout_WaitTime(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload, uint16_t wait);
		uint8_t sendPacketTimeout_length(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload, uint16_t length16);
		uint8_t sendPacketTimeout_wait_length(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload, uint16_t length16, uint16_t wait);
		uint8_t sendPacketTimeoutACK(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload);
		uint8_t sendPacketTimeoutACK_length(SPI_HandleTypeDef *hspi,	uint8_t dest, char *payload, uint16_t length16);
		uint8_t sendPacketTimeoutACK_wait(SPI_HandleTypeDef *hspi,
											uint8_t dest,
											char *payload,
											uint16_t wait);
		uint8_t sendPacketTimeoutACK_wait_length(SPI_HandleTypeDef *hspi, uint8_t dest,
											char *payload,
											uint16_t length16,
											uint32_t wait);
		uint8_t sendPacketTimeoutACKRetries(SPI_HandleTypeDef *hspi, uint8_t dest, char *payload);
		uint8_t sendPacketTimeoutACKRetries_length(SPI_HandleTypeDef *hspi, uint8_t dest,
												char *payload,
												uint16_t length16);
		uint8_t sendPacketTimeoutACKRetries_wait(SPI_HandleTypeDef *hspi, uint8_t dest,
												char *payload,
												uint32_t wait);
		uint8_t sendPacketTimeoutACKRetries_length_wait(SPI_HandleTypeDef *hspi,
												uint8_t dest,
												char *payload,
												uint16_t length16,
												uint32_t wait);
		uint8_t sendWithMAXTimeout(SPI_HandleTypeDef *hspi);
#endif
